
--创建表、插入数据
CREATE TABLE employee (
    id INT PRIMARY KEY AUTO_INCREMENT COMMENT '主键ID',
    workno VARCHAR(20) COMMENT '工号',
    name VARCHAR(20) COMMENT '姓名',
    gender CHAR(1) COMMENT '性别',
    age TINYINT COMMENT '年龄',
    idcard VARCHAR(20) COMMENT '身份证号',
    workaddress VARCHAR(50) COMMENT '工作地址',
    entrydate DATE COMMENT '入职日期'
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COMMENT '员工信息表';
INSERT INTO employee (workno, name, gender, age, idcard, workaddress, entrydate) VALUES ('1', '柳岩', '女', 20, '123456789012345678', '北京', '2000-01-01'), ('2', '张无忌', '男', 18, '123456789012345670', '北京', '2005-09-01'), ('3', '韦一笑', '男', 38, '123456789712345670', '上海', '2005-08-01'), ('4', '赵敏', '女', 18, '123456757123845670', '北京', '2009-12-01'), ('5', '小昭', '女', 16, '123456769012345678', '上海', '2007-07-01'), ('6', '杨道', '男', 28, '12345678931234567X', '北京', '2006-01-01'), ('7', '范瑶', '男', 40, '123456789212345670', '北京', '2005-05-01'), ('8', '黛绮丝', '女', 38, '123456157123645670', '天津', '2015-05-01'), ('9', '范凉凉', '女', 45, '123156789012345678', '北京', '2010-04-01'), ('10', '陈友谅', '男', 53, '123456789012345670', '上海', '2011-01-01'), ('11', '张士诚', '男', 55, '123567897123465670', '江苏', '2015-05-01'), ('12', '常遇春', '男', 32, '123446757152345670', '北京', '2004-02-01'), ('13', '张三丰', '男', 88, '123656789012345678', '江苏', '2020-11-01'), ('14', '灭绝', '女', 65, '123456719012345670', '西安', '2019-05-01'), ('15', '胡青牛', '男', 70, '12345674971234567X', '西安', '2018-04-01'), ('16', '周芷若', '女', 18, NULL, '北京', '2012-06-01');

--1.查询年龄为20,21,22,23岁的员工信息。
select * from emp where age>=20 && age<=23;
--2.查询性别为男，并且年龄在20-40岁(含)以内的姓名为三个字的员工。 
select * from emp where gender='男' && age between 20 and 40 && name like '___';
--3.统计员工表中，年龄小于60岁的，男性员工和女性员工的人数。
select gender,count(*) '人数' from emp where age<60 group by gender;
--4.查询所有年龄小于等于35岁员工的姓名和年龄，开对查询结果按年龄升序排序，如果年龄相同按入职时间降序排序。
select name,age from emp where age<=35 order by age,entrydate desc;
--5．查询性别为男，且年龄在20-40岁含)以内的前5个员工信息，对查询的结果按年龄升序排序，年龄相同按入职时间升序排序。
select * from emp where age between 20 and 40 && gender='男' order by age,entrydate limit 0,5;
